packages/p2p-network/src/nat-traversal/templates/delete-port-mapping.ejs

<?xml version="1.0"?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <s:Body>
    <u:DeletePortMapping xmlns:u="urn:schemas-upnp-org:service:WANIPConnection:1">
      <NewRemoteHost></NewRemoteHost>
      <NewExternalPort><%= port %></NewExternalPort>
      <NewProtocol><%= protocol %></NewProtocol>
    </u:DeletePortMapping>
  </s:Body>
</s:Envelope>
